Catalogs/Лицензии1С.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Лицензии1С</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицензии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЛицензий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПользователей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Область</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корпус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПинКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>19</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПинКодов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПинКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>19</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаАктивации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКомпьютера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыЛицензий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ТипыЛицензий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Серверная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиентская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отраслевая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Лицензии1С/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСБуферомОбменаКлиентСервер.ДобавитьЭлементыФормыДляHTMLБуфера(ЭтотОбъект, Элементы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтобразитьДоступностьКоличествоПользователей();
	ОтобразитьТекущуюСтраницу("Общее");
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЛицензииПриИзменении(Элемент)

	ПеречислениеТипСерверная = ПредопределенноеЗначение("Перечисление.ТипыЛицензий.Серверная");
	Если Объект.ТипЛицензии = ПеречислениеТипСерверная Тогда
		Объект.КоличествоПользователей = 1;
	КонецЕсли;
	
	ОтобразитьДоступностьКоличествоПользователей();
	
КонецПроцедуры       

&НаКлиенте
Процедура ОтобразитьДоступностьКоличествоПользователей()
	
	ПеречислениеТипСерверная = ПредопределенноеЗначение("Перечисление.ТипыЛицензий.Серверная");
	ЭтоСервернаяЛицензия = (Объект.ТипЛицензии <> ПеречислениеТипСерверная);
	Элементы.КоличествоПользователей.Доступность = ЭтоСервернаяЛицензия;

КонецПроцедуры // ОтобразитьДоступностьКоличествоПользователей()

&НаКлиенте
Процедура КомандаСделатьПинКодАктивным(Команда)
	
	ТекущаяСтрокаПинКодов = Элементы.ТаблицаПинКодов.ТекущиеДанные;
	
	Если ТекущаяСтрокаПинКодов <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(ТекущаяСтрокаПинКодов.ДатаАктивации)
			Или Не ЗначениеЗаполнено(ТекущаяСтрокаПинКодов.ИмяКомпьютера) Тогда
			
			ПоказатьПредупреждение(, "Для указания пин-кода как активного необходимо указать Дату активации и Имя компьютера");
		Иначе
			Объект.ТекущийПинКод = ТекущаяСтрокаПинКодов.ПинКод;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПинКодНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СкопироватьЗначениеВБуфер(Строка(Объект.ТекущийПинКод));	
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитРегистрационныхДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СкопироватьЗначениеВБуфер(Строка(Объект[Элемент.Имя]));
	
КонецПроцедуры 

&НаКлиенте
Процедура СкопироватьЗначениеВБуфер(Значение)

	РаботаСБуферомОбменаКлиентСервер.СкопироватьВБуферОбмена(Значение, ЭтотОбъект["ПолеHTMLБуфера"]);

КонецПроцедуры // СкопироватьЗначениВБуфер()

&НаКлиенте
Процедура КомандаОбщее(Команда)
	
	ОтобразитьТекущуюСтраницу("Общее");
	
КонецПроцедуры       

&НаКлиенте
Процедура КомандаРегистрационныеДанные(Команда)
	
	ОтобразитьТекущуюСтраницу("РегистрационныеДанные");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПинКоды(Команда)
	
	ОтобразитьТекущуюСтраницу("ПинКоды");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьТекущуюСтраницу(ТекущаяСтраницаФормы)

	Если ТекущаяСтраницаФормы = "Общее" Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОбщее;
	ИначеЕсли ТекущаяСтраницаФормы = "РегистрационныеДанные" Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРегистрационныеДанные;
	ИначеЕсли ТекущаяСтраницаФормы = "ПинКоды" Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПинКоды;
	КонецЕсли;
	
	Элементы.КомандаОбщее.Доступность					= ТекущаяСтраницаФормы <> "Общее";
	Элементы.КомандаРегистрационныеДанные.Доступность	= ТекущаяСтраницаФормы <> "РегистрационныеДанные";
	Элементы.КомандаПинКоды.Доступность				= ТекущаяСтраницаФормы <> "ПинКоды";

КонецПроцедуры // ОтобразитьТекущийОтбор()
